# -*- coding: utf-8 -*-
"""
Задание 5.2
Запросить у пользователя ввод IP-сети в формате: 10.1.1.0/24
Затем вывести информацию о сети и маске в таком формате:
Network:
10        1         1         0
00001010  00000001  00000001  00000000
Mask:
/24
255       255       255       0
11111111  11111111  11111111  00000000
Проверить работу скрипта на разных комбинациях сеть/маска.
Вывод сети и маски должен быть упорядочен также, как в примере:
- столбцами
- ширина столбца 10 символов (в двоичном формате
  надо добавить два пробела между столбцами
  для разделения октетов между собой)
Подсказка: Получить маску в двоичном формате можно так:
In [1]: "1" * 28 + "0" * 4
Out[1]: '11111111111111111111111111110000'
Ограничение: Все задания надо выполнять используя только пройденные темы.
"""

network_and_mask = input("Введите IP-сеть в формате 10.1.1.0/24: ").split("/")
ip_list = network_and_mask[0].split(".")
network = """Network:
{0:<8}  {1:<8}  {2:<8}  {3:<8}
{0:08b}  {1:08b}  {2:08b}  {3:08b}
"""
binary_mask = "1" * int(network_and_mask[1]) + "0" * (32 - int(network_and_mask[1]))
octet1 = int(binary_mask[:8], 2)
octet2 = int(binary_mask[8:16], 2)
octet3 = int(binary_mask[16:24], 2)
octet4 = int(binary_mask[24:], 2)

mask = """Mask:
/{0:}
{1:<8}  {2:<8}  {3:<8}  {4:<8}
{1:08b}  {2:08b}  {3:08b}  {4:08b}
"""
#print(ip_list)
#print(network.format(192,168,1,1))
print(network.format(int(ip_list[0]), int(ip_list[1]), int(ip_list[2]), int(ip_list[3])), end="")
print(mask.format(network_and_mask[1], octet1, octet2, octet3, octet4))
